# Задание 9. Уровень - ну просто мастер.

# Условие: все просто. Сделать предыдущую задачу на GoLang'e.

# Пример:
# Ввод:                                      # Вывод:
# hello, world!                              l: 3
#                                            o: 2
#                                            d: 1
#                                            e: 1
#                                            h: 1
#                                            r: 1
#                                            w: 1